In [1]:
import pandas as pd

To List all the datasets, which we have

In [2]:
import os
os.listdir('../../datasets')

['.DS_Store',
 '.ipynb_checkpoints',
 '107983_aariclist_25k.csv',
 'crime.h5',
 'customer.csv',
 'customers.csv',
 'example.csv',
 'fifa19.csv',
 'fifa19.zip',
 'file_example_CSV_5000.csv',
 'formula-1-race-data-19502017',
 'Fremont_Bridge_Hourly_Bicycle_Counts_by_Month_October_2012_to_present.csv',
 'google-play-store-apps',
 'IFSC.csv',
 'IMDB_Movie.csv',
 'IMDB_Movie.html',
 'IMDB_Movie.json',
 'IMDB_Movie.xlsx',
 'IMDB_Movie_2columns.csv',
 'IMDB_Movie_3columns.csv',
 'IMDB_Movie_3columns.html',
 'IMDB_Movie_3columns.json',
 'IMDB_Movie_3columns.xls',
 'IMDB_Movie_3columns_without_index.csv',
 'IMDB_Movie_3columns_with_index.csv',
 'IMDB_Movie_Apply.csv',
 'imdb_movie_cleanup.csv',
 'IMDB_Movie_Facebook_Like.csv',
 'IMDB_Movie_Filter.csv',
 'IMDB_Movie_Overview.csv',
 'IMDB_Movie_Sorting.csv',
 'international-airline-passengers.csv',
 'Land Usage Report.csv',
 'Live_Street_Address_Management_SAM_Addresses.csv',
 'lynda.com Courses.csv',
 'MplsStops.csv',
 'multiTimeline.csv',
 'opsd_germany_daily.csv',
 'orders.csv',
 'output-1.csv',
 'pandas_created_file.csv',
 'pivot-tables.xlsx',
 'PJME_hourly.csv',
 'Sales_Data.json',
 'Sales_Data.xlsx',
 'ted_main.csv',
 'Titanic_Desaster.csv',
 'Weather_2012.csv',
 'weight-height.zip',
 'world-happiness-report-2019.csv']

### 1. loading data from csv

In [3]:
df_csv = pd.read_csv('../../datasets/IMDB_Movie_3columns.csv')
df_csv.head()

,movie_title,director_name,title_year
0,Avatar,James Cameron,2009.0
1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,Spectre,Sam Mendes,2015.0
3,The Dark Knight Rises,Christopher Nolan,2012.0
4,Star Wars: Episode VII - The Force Awakens ...,Doug Walker,NaN

### 2. loading data from excel
    - user could choose sheet number incase excel file contain multiple sheet

In [4]:
df_excel = pd.read_excel('../../datasets/IMDB_Movie.xlsx', sheet_name=0)
df_excel

                                 movie_title   director_name  title_year
0                                    Avatar    James Cameron        2009
1  Pirates of the Caribbean: At World's End   Gore Verbinski        2007
2                                   Spectre       Sam Mendes        2015

### 3. loading data from json

In [5]:
df_json = pd.read_json('../../datasets/IMDB_Movie.json')
df_json.head()

                                movie_title   director_name  title_year
0                                    Avatar   James Cameron        2009
1  Pirates of the Caribbean: At World's End  Gore Verbinski        2007
2                                   Spectre      Sam Mendes        2015

### 4. loading data from a table on html web page
    - note that read_html return a list of data table, so to access one talbe need to have table index

In [6]:
df_html = pd.read_html('../../datasets/IMDB_Movie.html')
df_html[0].head()

,Unnamed: 0,movie_title,director_name,title_year
0,0,Avatar,James Cameron,2009.0
1,1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,2,Spectre,Sam Mendes,2015.0

### 5. loading from a python dictionary
    - key become columns name
    - value become row data

In [7]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}

df_dic = pd.DataFrame(studentData)
df_dic

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

In [8]:
# loading data from coinmarketcap
df_cmc = pd.read_html('http://coinmarketcap.com')
df_cmc

[Empty DataFrame
 Columns: [#, Name, Market Cap, Price, Volume (24h), Circulating Supply, Change (24h), Price Graph (7d), Unnamed: 8]
 Index: [],
 Empty DataFrame
 Columns: [#, Name]
 Index: [],
       #           Name        Market Cap      Price     Volume (24h)  \
 0     1        Bitcoin  $126,904,116,812  $6,926.73  $35,940,894,445
 1     2       Ethereum   $17,672,506,396    $159.94  $15,133,524,310
 2     3            XRP    $8,340,256,994  $0.189642   $2,102,208,874
 3     4         Tether    $6,439,215,027      $1.01  $45,224,588,206
 4     5   Bitcoin Cash    $4,299,510,249    $233.94   $3,290,445,777
 ..  ...            ...               ...        ...              ...
 95   96  Matic Network       $33,718,677  $0.012224      $15,559,790
 96   97          Ardor       $33,307,945  $0.033341       $1,808,949
 97   98     Blockstack       $32,616,387  $0.091434         $196,522
 98   99            WAX       $32,032,643  $0.028964         $688,260
 99  100      Aeternity       $31,123,924  $0.101354       $5,991,760

        Circulating Supply Change (24h)  Price Graph (7d)  Unnamed: 8
 0          18,320,925 BTC        0.89%               NaN         NaN
 1         110,493,603 ETH        1.01%               NaN         NaN
 2    43,978,966,311 XRP *        0.61%               NaN         NaN
 3    6,361,032,509 USDT *        1.19%               NaN         NaN
 4          18,378,375 BCH        0.98%               NaN         NaN
 ..                    ...          ...               ...         ...
 95  2,758,503,686 MATIC *        0.06%               NaN         NaN
 96     998,999,495 ARDR *       -0.09%               NaN         NaN
 97      356,719,546 STX *       -1.05%               NaN         NaN
 98   1,105,933,793 WAXP *       -0.13%               NaN         NaN
 99         307,082,596 AE        0.31%               NaN         NaN

 [100 rows x 9 columns]]

In [9]:
len(df_cmc)

3

In [10]:
df_cmc_table = df_cmc[2][['Name', 'Market Cap', 'Price', 'Volume (24h)', 'Circulating Supply', 'Change (24h)']]
df_cmc_table.head(3)

,Name,Market Cap,Price,Volume (24h),Circulating Supply,Change (24h)
0,Bitcoin,"$126,904,116,812","$6,926.73","$35,940,894,445","18,320,925 BTC",0.89%
1,Ethereum,"$17,672,506,396",$159.94,"$15,133,524,310","110,493,603 ETH",1.01%
2,XRP,"$8,340,256,994",$0.189642,"$2,102,208,874","43,978,966,311 XRP *",0.61%